In [1]:
import pandas as pd

In [2]:
data = [{'name':'test1', 'age':21},{'name':'test2', 'age':24}]
data

[{'name': 'test1', 'age': 21}, {'name': 'test2', 'age': 24}]

In [3]:
df = pd.DataFrame(data)
df

    name  age
0  test1   21
1  test2   24

In [4]:
df.replace({
    21:22
})

    name  age
0  test1   22
1  test2   24